001_Конспекты_2/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заметки</name>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.Темы</types>
    </type>
  </attributes>
  <attributes>
    <name>Лекция</name>
    <type>
      <types>CatalogRef.Лекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ЗаметкиФайлы</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Высота</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Примечания</name>
    <attributes>
      <name>Текстовка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>EnumRef.ВидыПримечаний</types>
      </type>
    </attributes>
    <attributes>
      <name>id</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

001_Конспекты_2/src/Enums/ВидыСписковHTML/ВидыСписковHTML.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыСписковHTML</name>
  <enumValues>
    <name>Маркированный</name>
  </enumValues>
  <enumValues>
    <name>Нумерованный</name>
  </enumValues>
  <enumValues>
    <name>Определений</name>
  </enumValues>
</mdclass:Enum>

001_Конспекты_2/src/Catalogs/Заметки/Forms/ФормаВводаСписка/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура призакрытии(завершениеработы)

	МассивСтрок = Новый массив;

	Для Каждого СтрокаЭлемент Из таблицастрок Цикл
		МассивСтрок.Добавить(СтрокаЭлемент.Значение_li);
	КонецЦикла;

	структурапараметров = Новый структура;
	структурапараметров.вставить("вид", вид);
	структурапараметров.вставить("тип", тип);
	структураПараметров.Вставить("reversed"	, reversed);
	СтруктураПараметров.Вставить("start"	, start);
	СтруктураПараметров.Вставить("value"	, value);
	СтруктураПараметров.Вставить("Строки"	, МассивСтрок);
	
	ОповеститьОВыборе(СтруктураПараметров);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 Вид = Перечисления.ВидыСписковHTML.Маркированный;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
